# 1. Найти факториал 2. проверить на простое ли число(pytest) 3. ... 4. сортируем список слов по длине, где слово это ключ, а значение = список
import math

n = int ( input ( "Введите число: " ) )
print(math.factorial(n))




